doc: upd readme
